{
  "pageTitle": "Apprendre",
  "categories": {
    "definitions": "définitions",
    "maths": "mathématiques",
    "physics": "physique",
    "tips": "conseils pratiques",
    "glossary": "glossaire temperapp"
  },
  "sheets": {
    "definition": {
      "label": "Définition",
      "content": "### Le tempérament… selon Jean-Jacques Rousseau\n  > « Opération par laquelle, au moyen dʼune légère altération dans les Intervalles, faisant évanouir la différence de deux sons voisins, on les confond en un, qui, sans choquer lʼoreille, forme les Intervalles respectifs de lʼun & de lʼautre. Par cette opération lʼon simplifie lʼEchelle, en diminuant le nombre des Sons nécessaires. Sans le Tempérament, au lieu de douze Sons seulement que contient lʼOctave, il en faudroit plus de soixante pour moduler dans tous les Tons ».  \n  > - J. J. Rousseau, Extrait de « Tempérament », _Dictionnaire de la musique_, 1764.\n  \n  ### Qu’est-ce qu’un tempérament? Une réponse plus actuelle...\n\n  >Le tempérament musical est l’ensemble des choix esthétiques faits au cours de l'accord d’un instrument de musique. \n\n  La définition de Jean-Jacques Rousseau résume ce qu’on peut considérer comme un triple compromis que constitue un tempérament musical. Il s’agit de trouver une solution qui combine de la façon la plus satisfaisante, selon le contexte (le répertoire, les instruments concernés, etc.) : un paramètre physique et matériel (la “jouabilité” sur les instruments, sur un clavier, un manche avec des frettes, etc.), un paramètre musical (pouvoir moduler le plus librement et le plus loin possible), et un paramètre esthétique (conserver ou pas le plus possible d’intervalles purs “sans choquer l’oreille”).\n  \n  ### Le tempérament : pour quels instruments?\n  \n  L’accord et le tempérament concernent les instruments à sons “fixes”, c’est-à-dire ceux dont les notes sont accordées avant que l’instrumentiste joue. Il s’agit entre autres des claviers tels que le clavecin, l’orgue ou le piano.\n\n  Il ne faut pas confondre accord et justesse : on accorde un instrument avant d’en jouer, tandis que la justesse apparaît au moment du jeu.\n\n  ### Le tempérament est-il historique ?\n\n  Avant le XIXe siècle, les choix esthétiques d’accord correspondaient à des usages, des modes ou des habitudes en fonction des époques, des régions et d’autres facteurs influençant la musique elle-même. Il n’y avait donc pas de “choix” proprement dit mais des bonnes et des mauvaises manières d’accorder selon le lieu, le moment et les circonstances matérielles.\n\n  ### L’accord : une pratique contemporaine \n\n  A l’heure où les musiciens se penchent sur des répertoires anciens, il leur faut retrouver pour chacun de ces répertoires la manière d’accorder correspondant aux usages en vogue au moment de leur composition, condition nécessaire pour se rapprocher le plus possible de  leur réalité sonore.\n\n  La notion de tempérament musical permet à un accordeur contemporain de rendre objectifs les critères qui faisait un bon accord pour un certain répertoire, et de donner un nom à cette manière d’accorder. Les tempéraments ont donc souvent des noms de compositeurs voire d’auteurs, des dates et des régions d’usages. Ces informations sont souvent moins absolues et véridiques que simplement utiles pour associer une technique d’accord à un répertoire. \n\n  ### Comment *décrire* un tempérament?\n\n  L’accordeur n’a jamais une liberté totale pour chaque note d’un instrument. Des contraintes réduisent les choix qu’il peut faire et permettent de résumer un tempérament en un petit nombre d’informations : \n  \n  >*un petit nombre de valeurs numériques qui décrivent certains intervalles.*\n\n  Ces valeurs représentent le **degré de fausseté** ou **tempérament** des intervalles. Un intervalle est dit **tempéré** s’il est accordé avec un certain degré de fausseté, s’il présente donc un écart par rapport à l’intervalle **pur** (cf. “les mathématiques”).\n\n  >Le degré de fausseté d’un intervalle peut être lui-même exprimé comme un intervalle : \n  \n  celui qui sépare l’une des notes de l’intervalle tempéré de sa valeur pure. \n\n### Quelles valeurs numériques?  \n\nOn utilise aujourd’hui des valeurs numériques, avec lesquelles il est facile de faire des recherches ou de programmer.\n\nLe clavier des instruments à sons fixes contient douze notes par octave. Toute l’information décrivant un tempérament peut donc être contenue dans douze valeurs. \n\n  > Pour manipuler ces valeurs, il est nécessaire de comprendre les mathématiques du tempérament musical.\n  \n  Les notes d'un clavier à 12 touches par octave comme le piano, le clavecin ou l'orgue sont reliées par un cycle de 12 quintes ou de 12 demi-tons. \n\nLes tempéraments historiques ou plus récents pour clavier peuvent être donc définis comme \n12 valeurs affectant les quintes : le **cycle des quintes**\nou comme 12 valeurs affectant les demi-tons : la **table de déviation** en unité “cent”.\n  \n  Les principes sur lesquels ont été élaborés ces tempéraments ont évolué dans le temps ; un tempérament est non seulement une information précieuse sur l'évolution de la pensée théorique, mais surtout un témoignage sonore irréfutable et sans équivalent.\n  \n  Pour plus d’information sur les unités voir “glossaire”\n\n  ### Le tempérament égal\n\n  Le tempérament égal est une  norme européenne en vogue depuis le début du XIXe siècle. Il s’est imposé progressivement en dehors de la musique savante et de ses frontières d’origine. Aujourd’hui il est la norme dans la facture instrumentale et dans les musiques savantes autant que populaires. Toujours lié à cet héritage occidental récent, il coexiste avec d’autres normes dans des espaces culturels différents. \n  \n  Dans le tempérament égal, les douze quintes sont diminuées d’un douzième de comma pythagoricien. Les notes enharmoniques ont la même fréquence. L’intervalle séparant deux notes est constant. \n\n  ### Les systèmes mésotoniques \n\n  Contrairement au tempérament de l’école pythagoricienne, qui se base sur la pureté des quintes, les systèmes mésotoniques se fondent sur une recherche de pureté des tierces. \n  \n  Dans les systèmes mésotoniques, chaque quinte est tempérée de la même  fraction de comma syntonique. \n\n  La dernière ferme le cycle, elle est souvent démesurément agrandie et sa sonorité, de fait, très rude : pour cela elle est appelée “quinte du loup” . Dans le cycle des quintes, elle marque le passage des dièses aux bémols. Ainsi la quinte du loup est placée le plus couramment entre sol# et mib. Bien que cet intervalle soit une quinte pour l’accordeur, il est une sixte diminuée pour le compositeur ou l’interprète et sa fausseté est parfois employée comme effet musical. \n\n  Les systèmes suivants emploient des fractions différentes de comma syntonique (ici n). \n\n  - $ n \\small = \\dfrac{1}{4} \\quad $ Système de P. Aaron (1523)\n\n  - $ n \\small = \\dfrac{1}{10} \\quad $ Système de Lanfranco (1533)\n\n  - $ n \\small = \\dfrac{2}{7} \\quad $ Système de G. Zarlino (1558))\n  - $ n \\small = \\dfrac{1}{3} \\quad $ Système de F. Salinas (1577)\n  - $ n \\small = \\dfrac{2}{9} \\quad $ Système de L. Rossi (1666)\n  - $ n \\small = \\dfrac{1}{5} \\quad $ Système de J. Sauveur (1710)\n  - $ n \\small = \\dfrac{1}{6} \\quad $ Système de G. Silbermann (1748)\n  - $ n \\small = \\dfrac{5}{18} \\quad $ Système de R. Smith (1749)\n  - $ n \\small = \\dfrac{3}{10} \\quad $ Système de J.B. Romieu (1758)\n\n  ### Approfondissement\n\n  Le système présenté ici est fondé sur le cycle des quintes de $ \\small  mi \\flat-sol\\sharp$.\n\n  La quinte du loup est plus grande que la quinte naturelle si $n \\small > \\dfrac{1}{10}$ et plus petite si $n \\small \\leq \\dfrac{1}{10}$.\n  \n  La tierce majeure est plus grande que la tierce naturelle si $ n \\small < \\dfrac{1}{4} $ et plus petite si $ n \\small > \\dfrac{1}{4}$.\n  Pour le cas $ n \\small = \\dfrac{1}{4} $ , les huit tierces majeures sont pures.\n\n\n  Un cas particulier du système mésotonique est le tempérament égal.  \n\n\n  "
    },
    "mathematics": {
      "label": "Mathématiques",
      "content": "### longueurs de cordes - fréquences\n  Des auteurs grecs jusqu'au XIXe siècle, un intervalle était défini par un rapport de longueurs de cordes : le rapport des sons était celui des longueurs des cordes qui les forment (ainsi le rapport mathématique était 1:2 pour l’octave, 2:3 pour la quinte, 3:4 pour la quarte, 4:5 pour la tierce majeure, 5:6 pour la tierce mineure, etc.). De nos jours, on emploie le rapport des fréquences des deux notes qui forment l'intervalle. On le nomme rapport acoustique, et il correspond à l'inverse du rapport des longueurs. Les rapports acoustiques des intervalles simples à l'état pur sont ainsi les suivants :\n\n  $ \\text{octave : 2} $\n\n  $ \\text{quinte : 3/2 } $\n\n  $ \\text{quarte : 4/3 } $ \n\n  $ \\text{tierce majeure : 5/4 } $\n\n  $ \\text{tierce mineure 6/5} $\n    \n \n\n  > Le rapport acoustique est indépendant de la fréquence de la note sur laquelle on construit l’intervalle. \n\n  Pour obtenir la quinte d’une note quelconque, il faudra toujours multiplier la fréquence de  cette note par $3/2$.\n\n  ### Manipuler les intervalles à l’aide des mathématiques\n  \n  De la même manière qu’on enchaîne les intervalles sur un clavier en élevant successivement une note d’un intervalle puis d’un autre, on peut calculer le rapport acoustique qui en résulte :\n  \n  >le rapport acoustique de la somme de deux intervalles est le produit des rapports acoustiques des deux intervalles.\n  \n  Ce principe s'illustre par la complémentarité des deux tierces dans la quinte :\n  \n  $\\text{tierce majeure + tierce mineure = quinte} $\n  \n  $\\Rightarrow  5/4 \\times  6/5 = 3/2 $\n  \n  ou par la complémentarité de la quinte et de la quarte dans l'octave :\n  \n  $\\text{quinte + quarte = octave} $\n  \n  $\\Rightarrow  3/2 \\times  4/3 = 2 $\n  \n  > Soustraire un intervalle à un deuxième revient à diviser le rapport acoustique de ce dernier par celui du premier, soit par exemple :\n  \n  $\\text{quarte – tierce majeure = demi-ton} $\n  \n  $\\Rightarrow  4/3 \\div 5/4 = 16/15 $\n\nDans le “glossaire” au chapitre **cent** on expliquera comment les intervalles peuvent être décrit en nombres qui s’additionnent.\n\n  ### Construire une gamme à l’aide des mathématiques\n\n  Pour construire les douze notes de la gamme, on commence par une fréquence de départ quelconque $f_{1}$. On élève cette note de douze quintes successivement $$f_{1} \\underbrace{\\times \\frac{3}{2} \\times \\frac{3}{2} ...}_{12 \\times } = f_{1} \\times \\left( \\dfrac{3}{2}\\right)^{12}$$\n\n  On obtient la douzième fréquence $f_{12}$. Si on est parti de Do, on a obtenu toutes les fréquences jusqu’à… si# bien sûr! En effet, puisqu’on est monté en quintes pures, la dernière note n’est pas exactement à l’unisson de la première. Pour les comparer, on abaisse la douzième note de 7 octaves : $$f^\\prime_{12}=\\frac{f_{12}}{2^{7}}$$ Puis on calcule l’intervalle entre ces deux notes presque à l’unisson, et on obtient le petit intervalle appelé comma pythagoricien : \n\n  >$$ \\Large C_{p}=\\frac{f^\\prime_{12}}{f_{1}} = \\frac{3^{12}}{2^{19}} $$\n\n  ### Diviser un intervalle? \n\n  Le rapport acoustique correspondant à la division d’un intervalle en n intervalles égaux se calcule en prenant sa racine n-ième : C’est l’opération qui consiste par exemple à répartir le comma pythagoricien sur les douze quintes, qu’on abaisse toutes d’un petit intervalle dont la valeur est $$\\sqrt[12]{C_{p}}$$. De même dans le tempérament mésotonique usuel, la tierce majeure est constituée de deux tons égaux dont le rapport acoustique est $\\sqrt{\\frac{5}{4}}$.\n  \n  ### Pureté et tempérament\n\n  La somme d'intervalles purs (qui, à l'audition, sont dénués de battement, voir \"physique”) entraîne la production de petits intervalles appelés **commas** qui affectent la pureté voire la jouabilité d'autres intervalles. \n  \n  >Tempérer un intervalle, c'est l'éloigner de son état de pureté afin d'amoindrir voire annuler l'effet de ces commas.\n  \n  Par extension, un tempérament est une façon d'organiser ces déviations de la pureté dans une échelle donnée.\n\n  ### Les commas\n\n  TemperApp utilise les commas syntonique et pythagoricien :\n\n  Le comma pythagoricien  ($ \\small C_{p}$) est l’intervalle entre une note élevée de douze quintes pures et la même note élevée de 7 octaves.\n\n  > $$ C_{p} = \\dfrac{ \\left( \\dfrac{3}{2} \\right)^{12}}{2^{7}} = \\dfrac{3^{12}}{2^{19}}  $$\n\n  Le comma syntonique ($\\small C_{s}$) ou comma zarlinien est l’intervalle entre une note élevée de quatre quintes pures et la même note élevée d’une tierce majeure pure et d’une octave.\n  \n  >$$ C_{s} = \\dfrac{\\left(\\dfrac{3}{2}\\right)^{4}}{2 \\times \\dfrac{5}{4}} = \\dfrac{81}{80} $$\n\n  Les deux nombres (fractions) représentant les intervalles $\\small C_{s}$ et $\\small C_{p}$ n’ont pas de relation arithmétique entre eux. Mais lorsqu’on les divise on remarque la quasi égalité suivante :\n\n  >$$ \\dfrac{C_{p}}{12} \\approx \\dfrac{C_{s}}{11} $$\n\nCette valeur est souvent choisie comme unité d’intervalle (voir “glossaire”)\n\n  ### Représentation mathématique des intervalles usuels : les quintes\n\n  Les mathématiques représentent par des équations simples le geste de l’accordeur. Pour décrire une quinte tempérée, le mathématicien (comme l’accordeur) part d’une quinte pure, et écrit la fréquence des notes en Hz :\n  \n > $$ \\textrm{Sol} = \\dfrac{3}{2} \\times \\textrm{Do}$$ \n\n  La fréquence du sol *pur sur Do* est donc trop haute. Il faut *l’abaisser* d’une fraction de comma. Supposons que l’accordeur souhaite une quinte au tempérament égal : il faut l’abaisser d’un douzième de comma pythagoricien. Comme tous les intervalles, le comma pythagoricien peut se diviser en prenant sa **racine** : \n  \n  > $$\\sqrt[12]{C_{p}}$$\n\n  Une autre écriture de cette racine permet plus de clarté : \n  \n  > $$\\sqrt[12]{C_{p}}=C_{p}^{{}^{\\tfrac{1}{12}}}$$\n\n  L’équation qui donne la fréquence du Sol par rapport au Do est donc \n\n  >$$\\textrm{Sol} = \\dfrac{3}{2} \\times \\textrm{Do} \\times {C_{p}}^{-\\tfrac{1}{12}}$$\n\n  Le signe “-” indique que le sol est **abaissé** de la fraction de comma. Sur le cycle des quintes, cette équation sera abrégée en $1/12$. Seules les quintes élargies sont notées “+”\n\n  ### Représentation mathématique des intervalles usuels : les tierces majeures\n\n  On associe habituellement les tierces au comma **syntonique** c’est-à-dire à la différence entre la tierce majeure obtenue par quatre quintes pures (dite pythagoricienne) et la tierce pure : \n\n>$$Cs = \\dfrac{1}{4} \\left( \\dfrac{3}{2} \\right)^{4} \\div \\dfrac{5}{4} = \\dfrac{81}{80}$$\n\nLe mathématicien représente donc les tierces tempérées à l’aide d’un exposant de comma syntonique plutôt que de comma pythagoricien, bien que les deux soient possibles. Or il se trouve que le onzième de comma syntonique un intervalle très proche du douzième de comma pythagoricien : \n\n>$$ \\dfrac{C_{p}}{12} \\approx \\dfrac{C_{s}}{11} $$ \n\nOn représente donc mathématiquement les tierces à l’aide de cette unité.\n  \n  Procédons comme avec les quintes. Pour représenter une tierce majeure “Vallotti” on commence par représenter sa valeur pure : \n  \n > $$\\textrm{Mi}=\\textrm{Do} \\times \\dfrac{5}{4}$$ \n  \n  Puis on prend 3 onzièmes de comma syntonique \n  \n  >$$C_{s}^{\\tfrac{3}{11}}$$\n  \n  Et on *monte* notre Mi pur de cet intervalle : \n  \n  >$$\\textrm{Mi} = \\textrm{Do} \\times \\dfrac{5}{4} \\times C_{s}^{\\tfrac{3}{11}}$$\n  \n  Sur le visuel TemperApp, on écrira simplement 3/11. \n\nUne tierce majeure du tempérament égal vaut 7/11.\n\n  "
    },
    "physics": {
      "label": "Physique",
      "content": "### Vibration des cordes et des tubes\n    \n  Une corde pincée, frappée ou frottée vibre à certaines fréquences qui dépendent de sa tension, de sa masse par unité de longueur, de son diamètre et d’autres paramètres physiques. Les règles de calcul des vibrations s’appliquent de la même manière aux tuyaux sonores.\n    \n  ### Modes de vibration\n\n  Lors de la vibration, plusieurs fréquences se superposent : une corde vibre sur toute sa longueur, mais chacune de ses subdivisions en 2, 3 et jusqu’à une infinité de parties vibrent aussi, à des fréquences plus élevées et à des amplitudes plus faibles. \n  \n  >On nomme ces vibrations les **partiels** ou **harmoniques**. \n  \n  ### Pureté d’un intervalle = unisson de partiels\n\n  Lorsque deux cordes vibrent à la même fréquence, leurs vibrations se cumulent, il s’agit d’un **unisson**.\n\nCet unisson peut se produire entre les fréquences fondamentales de deux notes, mais aussi entre ses fréquences partielles ou harmoniques. Un unisson entre des sons harmoniques forme un **intervalle pur**.  \n\nEntre une corde vibrant à $ \\small 200 \\textrm{ Hz} $ et une corde vibrant une quinte plus haut à $ \\small 300 \\textrm{ Hz} $ il existe un unisson : le troisième partiel de la première corde vibre à $ \\small 600 \\textrm{ Hz} $ , à l’unisson du deuxième partiel de la deuxième corde. L’intervalle est ici une **quinte pure**.\n\n ### Les battements\n\n  \n  Si l’on désaccorde très légèrement deux cordes à l’unisson, leurs vibrations se cumulent puis s’annulent alternativement : c'est un **battement**. La fréquence de ce battement est la différence entre les deux fréquences de l’unisson faux. L’unité du battement est donc le Hz.\n\nDe la même manière que deux cordes en unisson faux produisent un battement, deux fréquences partielles ou harmoniques peuvent produire un battement : cela caractérise les intervalles **tempérés**. \n    \n  \n>Le **battement** d’un intervalle est un unisson faux entre deux sons harmoniques très proches.\n\n  Dans l’exemple précédent, si l’on désaccorde la seconde corde à $ \\small 301 \\textrm{  Hz} $, on crée un unisson faux entre ces deux sons partiels : le premier vibre à $ \\small 600 \\textrm{ Hz} $  et le second à $ \\small 602 \\textrm{ Hz} $ . On percevra un battement à la fréquence de $ \\small 2 \\textrm{ Hz} $  (soit 2 battements par seconde).\n  \n  Le battement utile à l’accordeur est celui qui se produit sur **l’harmonique commun le plus grave**. Cet harmonique se situe au PPCM des deux fréquences pures. \n  \n  > Pour connaître la note sur laquelle l’intervalle bat : comparer les séries harmoniques des deux sons et identifier le 1er harmonique commun.\n  \n  Exemple : Do-Sol. \n  \n  S.H. de $\\small Do_{3} : Do_{3} - Do_{4}  - Sol_{4} -Do_{5} - Mi_{5} \\cdots $\n  \n  SH de $\\small Sol_{3} : Sol_{3} -Sol_{4} -Ré_{5}- Sol_{5} -Si_{5} \\cdots $\n  \n  Le premier harmonique commun est $$\\small Sol_{4}$$\n  \n  >La vitesse d’un battement dépend de la fréquence des notes sur laquelle est construit l’intervalle.  \n  \n  Car c’est la différence entre les deux valeurs. L’intervalle entre les deux, qui est un rapport (une division) lui, ne change pas.\n\n> un battement n’apparaît jamais seul : il coexiste avec une infinité de battements aux harmoniques supérieurs communs.\n\n   \n\n\n  ### Le rapport entre les battements\n\n  >Deux intervalles tempérés d’une même fraction de comma battent dans le rapport de l’intervalle qui les sépare.\n\n  Si la tierce  $ \\small  Do_{2}-Mi_{2}$ bat à $ \\small 2 \\textrm{ Hz} $  et qu’on tempère la tierce $ \\small  Sol_{2}-Si_{2}$ de la même quantité de comma, le battement de $ \\small  Sol-Si$ sera littéralement une quinte au dessus du battement de  $ \\small  Do-Mi$ soit $ 3/2 \\times 2 = 3 \\textrm{ Hz}  $. La quinte est ici l’intervalle qui sépare les deux intervalles tempérés.\n\n  D’une manière plus générale encore : \n\n  >deux intervalles battent dans le rapport de l’intervalle qui les sépare, que multiplie le rapport entre les fractions de comma dont ils sont tempérés. \n\n  Ainsi : $\\small Do-Sol$ (1/12) et $\\small Sol-Ré$ (1/6) battent dans le rapport \n  \n  $$ \\Large \\frac{3}{2} \\times \\frac{\\frac{1}{6}}{\\frac{1}{12}} \\normalsize = 3 $$\n\n  $\\small Sol-Ré$ bat 3 fois plus vite que $\\small Do-Sol$.\n\n  ### Cas particulier de la tierce $\\small Fa_{3}-La_{3}$ au La 440Hz.\n\nSa vitesse de battement par seconde  est directement calculable à partir de la quantité de comma répartie dans ses quatre quintes. \n\nOn effectue l’opération suivante : \n\nOn appelle $\\Sigma$  la somme des valeurs des quintes intérieures **en 1/12ème de Comma** (Ex. pour Vallotti : 8)\n\n11-$\\Sigma$ **Hz** est la vitesse de battement de la tierce (Ex. pour Vallotti : 11-8 = 3. La tierce Fa-La de Vallotti est donc tempérée à 3/11 de Cs et bat à 3/sec à 440Hz. La valeur à 415 est donc juste en deçà. \n  \n### Cas particulier des battements : les sons résultants \n\nLe phénomène physique du battement est  décrit par l’égalité trigonométrique suivante : \n\n>$$\\sin (\\omega )+\\sin (\\omega ^\\prime)=2 \\cdot \\sin \\left(\\frac{\\omega +\\omega ^\\prime} 2\\right)\\cdot \\cos \\left(\\frac{\\omega -\\omega ^\\prime} 2\\right)  $$\n\nL’oreille n’interprète pas les amplitudes négatives, la fréquence des battements est donc $$\\omega -\\omega ^\\prime$$.\n\nUn battement se produit donc entre chaque paire de signaux. Dans le cas où celui-ci est très élevé, il est interprété par l’oreille comme un nouveau signal. Ainsi le battement entre le Do et le Mi d’une tierce majeure pure est un son à la double octave inférieure du Do :\n\n>$$\\dfrac{5}{4}- 1 = \\dfrac{1}{4}$$\n\n\n    "
    },
    "advices": {
      "label": "Conseils Pratiques",
      "content": "### Accorder un clavecin, les gestes élémentaires\n    \n  Accorder un clavecin c’est savoir avant tout :\n\n  - tenir une clé d’accord, sans crispation et sans mouvement brusque\n\n  - accorder un intervalle pur : unisson, octave, quinte, quarte, tierce\n\n - tempérer une tierce à un battement ou une fraction de comma particuliers. \n  \n  - répartir ce tempérament dans les quatre quintes formant cette tierce, en utilisant le rapport des battement\n\nPuis, avec l’expérience :\n\n- tempérer une quinte à un battement ou une fraction particuliers\n\n- tempérer deux quintes dans deux tempéraments différents en utilisant le “cas général” du rapport des battements.\n    \n  ### Une procédure d’accord, qu’est-ce que c’est?\n  \n  C’est une succession de notes couvrant au minimum une octave appelée **partition** et permettant d’accorder un tempérament. Il existe une infinité de procédures possibles pour construire un tempérament. A commencer par la première note : théoriquement, rien n’interdit de commencer sa partition par un fa ou un ut#. Pourtant, les procédures efficaces sont peu nombreuses.  \n\n  ### Les procédures TemperApp  \n\nTemperApp propose des procédures d’accord répondant à certains critères :\n\n- Les procédures TemperApp sont construites sur des enchaînements de gestes élémentaires. \n\n- La plupart des procédures commencent du La, car les créateurs de TemperApp ont souhaité qu’un débutant puisse accorder sans prendre le risque d’avoir un La “hors diapason”, ce qui pourrait gêner sur un instrument de conservatoire par exemple.\n \n- La tierce $ \\small Fa - La$ est en général un bon début, car on peut retenir sa vitesse de battement facilement. \n\n- On accorde souvent en premier les quintes à l’intérieur de $ \\small Fa - La$ (dont la distribution est en général simple)\n \n- On va au plus vite à des intervalles purs (en général à gauche de Fa) et on utilise des preuves tierces-quintes.\n \n\n  Des “pop-ups” accompagnent l’utilisateur et lui expliquent les procédures. Ils contiennent toutes les informations nécessaires pour reproduire la procédure en autonomie.\n\nCes procédures n’ont aucune prétention à la perfection, elles sont de simples suggestions répondant aussi à des contraintes informatiques. Les auteurs de TemperApp ont d’ailleurs découvert la variété de leurs pratiques d’accordeur au cours de l’implémentation des procédures!\n\n ###Accord de deux clavecins par une seule personne​\n \n La façon commune d’accorder deux clavecins consiste à accorder l’un des clavecins (Cl 1) pour ensuite reproduire cet accord sur le deuxième (Cl 2) par unissons, l’opérateur muni d’une clé copiant note après note sur le Cl 2 le modèle donné sur le Cl 1 par une seconde personne. \nUne seule personne ne peut pas à la fois jouer une note sur chaque clavecin et tourner la clé. \nLa méthode que je propose, aussi rapide (peut-être même plus puisqu’elle ne pose pas de problème de coordination) et plus précise (car annulant la marge d’erreur de l’accord de l’unisson) utilise le procédé de la comparaison relative associée à l’écoute des battements : les deux notes, le modèle et sa copie, seront comparées sur une troisième, dont le statut est indifférent. \nSupposons le Cl 1 accordé. Le Cl 2 sera mis à sa droite si l’accordeur tient sa clé à droite, et inversement ; les deux claviers seront à portée des mains. \nIl s’agit de copier au moins 12 notes jointives dans le médium du Cl 1 au Cl 2 qui seront elles-mêmes dupliquées par la suite par octaves et unissons pour compléter l’accord du Cl 2. \nLe protocole est le même pour chaque note copiée : \n -  En jouant sur le Cl 1 la note à copier, on cherche sur le Cl 2 (sur le clavier de la note à accorder) une note qui crée avec la première un battement susceptible d’être mémorisé. Il faut éliminer les battements nuls ou trop rapides. La note du Cl 2 pourra être à la 3ce majeure, à la 4te, à la 5te (3ce mineure et 6te majeure si on en a l’expérience), inférieure ou supérieure, de la note à copier, de manière que l’intervalle rentre dans la main gauche sur le Cl 2. \n -  La clé sur la cheville de la note du Cl 2 en passe d’être copiée sur son modèle du Cl 1 peut maintenant être tournée en dupliquant précisément, à l’écoute de l’intervalle maintenant sur le Cl 2, la vitesse de battement mémorisée, en s’assurant que ce battement se produise du même côté de la valeur pure. \n  "
    },
    "glossary": {
      "label": "Glossaire TemperApp",
      "content": "### Les unités de TemperApp : les commas\n    \n  TemperApp propose une description très précise des tempéraments, c’est pourquoi les nombres sont écrits avec des unités adaptées.\n\n  ### **Cp** : le comma pythagoricien\n\n  Le comma pythagoricien est une unité de mesure du tempérament, couramment associé aux quintes. \n\nSur un cycle des quintes TemperApp, **F : 1/6** signifie **la quinte** $\\small \\textbf{Fa-Do}$ (quinte de l’accord de Fa Majeur) **est tempérée au 1/6ème de comma pythagoricien**.\n \n  En écriture mathématique et en Hz : \n  \n  $$\\small Do = Fa \\times \\frac{3}{2} \\times C_{p}^{-\\frac{1}{6}}$$\n  \n   - Une valeur 0 signifie une quinte pure\n\n   - Une valeur de 1/12 signifie une quinte au tempérament égal. \n\n   - Une valeur positive par exemple + 1/12 signifie une quinte plus élargie\n\n  ### **Cs** : le comma syntonique\n  \n  Le Comma syntonique est une unité de mesure du tempérament, couramment associé aux tierces.  \n\nSur un cycle des tierces TemperApp, **F : 7/11** signifie **la tierce** $\\small \\textbf{Fa-La}$** (tierce de l’accord de Fa Majeur) **est tempérée à 7/11èmes de comma pythagoricien**. \n\n  En écriture mathématique et en Hz : \n  \n  $$ \\small La = Fa \\times \\dfrac{5}{4} \\times C_{s}^{\\tfrac{7}{11}}$$\n\n  > NB : le 1/11ème de Comma syntonique est le même intervalle que le 1/12ème de Comma pythagoricien. \n\n  - Une valeur 0 signifie une tierce pure\n\n  - 7/11 est une tierce du tempérament égale\n\n  > NB : 7/11 Cs= 7/12 Cp : dans le tempérament égal, la tierce est 7 fois plus tempérée que la quinte !\n  \n  - 11/11 = 1 est une tierce pythagoricienne. Dans une octave,  trois tierces majeures superposées se partagent 21/11 de comma syntonique.\n\nNB : A la différence du comma pythagoricien dont on ne distribue que de toutes petites parties sur les quintes (1/6 , 1/12 etc.) on affecte les tierces de valeurs beaucoup plus grandes. C’est pourquoi on utilise l’unité 1/11ème Cs, qui permet de faire varier le dénominateur en nombres entiers.\n\n  ### **Cs/Cp** : deux unités possibles pour les quintes\n\n  Les tempéraments sont en général conçus par rapport aux tierces ou aux quintes (voir “Définitions”). Si le tempérament est conçu en Comma syntonique, alors ses valeurs exprimées en unité “Comma pythagoricien” seront moins élégantes. Par exemple, 1/6ème de Comma Pythagoricien vaut 1/(5,5)ème de Comma syntonique. L’utilisateur a donc la possibilité de choisir l’unité des quintes.\n\nNéanmoins, changer l’unité des tierces n’est pas utile, car elles sont toujours exprimées en 1/11ème de Comma syntonique qui est équivalent au 1/12ème de comma pythagoricien. Pour ne pas alourdir l’application, nous avons fait le choix de maintenir cette unité.    \n\n  ### Les unités de TemperApp : les battements\n\n  Le Hertz **Hz** est une unité de fréquence d’un phénomène cyclique. Il signifie “ cycles par seconde”. 440Hz signifie 440 vibrations par seconde. \n\n  **Bps** : Même unité que le Hz. Utile pour décrire les battements rapides, et pour les accordeurs qui comptent les battements par seconde\n\n  **Bpm** : Nombre de cycles par minute. **1 Hz=1 Bps = 60 Bpm**. Le Bpm est utile pour des battements plutôts lents, et si on a l’habitude du métronome. \n\nDans TemperApp, les battements rapides en Bpm sont décrits ainsi : \n\n>400 Bpm = **4 x 100 Bpm**. \n\nAinsi, l’accordeur peut utiliser un métronome ou retenir la vitesse en Bpm et compter 4 battements.\n\n### Le **cent** : unité des tables de déviation et des intervalles\n\nL’unité **cent** répond à deux contraintes :\n> **1.** additionner les intervalles plutôt que les multiplier (et éviter les puissances incommensurables ou les racines n-ièmes\n\nLes intervalles étant toujours des rapports (= des divisions), leur addition et soustraction s’expriment par des multiplication et des division. Leur multiplication et leur division sont des puissances et des racines. \n\nPour pallier à ces problèmes de calculs, les mathématiciens utilisent depuis le 17ème siècle les **logarithmes**. A chaque nombres **x** on associe un autre nombre  **log(x)** dans une *base*, par exemple **2**. La règle est la suivante : \n\n>$$x = 2^{\\log(x)}$$\n\nL’avantage des nombres exprimés en logarithme est que la multiplication est remplacée par l'addition, et ainsi de suite pour toutes les opérations : \n\n>$$\\log(x \\times y) = \\log (x ) + \\log(y)$$\n>$$\\log \\left( \\dfrac{x}{y}  \\right) = \\log (x ) - \\log(y)$$\n>$$\\log(x^p) = p \\times \\log(x)$$\n>$$\\log(\\sqrt[p]{x}) = \\dfrac{1}{p} \\log(x)$$\n\nOn peut donc faire tous les calculs en logarithme à l’aide d’une table de correspondance $$x \\rightarrow \\log(x)$$, et convertir le résultat obtenu en lisant la table dans l’autre sens.      \n\n>**2.** décrire les tempéraments      \n\nPour décrire les tempéraments, les musicologues ont pris l’habitude de faire la liste des intervalles entre les fréquences des douze notes de la gamme tempérée et celles du tempérament égal. Pour les manipuler plus facilement, ils utilisent les logarithmes en les adaptant à la particularité des intervalles d’être de très petits nombres (par exemple lorsqu’il s’agit de fraction de comma).\n\n>Si X et Y  sont deux notes en Hz, leur intervalle exprimé en **cent** vaut :\n> $$1200 \\cdot \\log_2 \\left( \\dfrac{Y}{X} \\right) $$\n\nDans cette unité :\n\n- Un demi-ton vaut 100 cent en tempérament égal\n- Un comma pythagoricien vaut environ 24 cent\n- 1/12ème Cp vaut 1,955 cent.  \n\n    "
    }
  }
}
