{
  "fifths": "Quintes",
  "thirds": "Tierces",
  "beatsTitle": "Accordeur",
  "procedureTitle": "Procédure",
  "modalTitle": "Aide • Accordeur",
  "modalSubTitle1": "Qualité des tierces et des quintes",
  "modalIncipit1": "Un nouveau visuel : pourquoi faire?",
  "modalContent1": "<p class=\"p-long\">A la fin de l’accord d’un clavecin, d’un orgue, etc. il est habituel d’enchaîner les accords majeurs en progressant par quinte, et d’en écouter la <strong>couleur</strong>. Cette <i>arpeggiatta</i> de l’accordeur est la description la plus fidèle d’un tempérament : on y perçoit la qualité de chaque accord, et la manière dont celle-ci progresse par tons voisins. Le visuel colorimétrique TemperApp a été développé pour reproduire ce geste de l’accordeur, en permettant de percevoir le résultat d’un tempérament <strong>au clavier</strong>.</p>",
  "modalIncipit1.5": "Le visuel colorimétrique",
  "modalContent1.5": "<p class=\"p-long\">Le visuel TemperApp permet de prévoir en un coup d'œil la sonorité de tous les <strong>accords majeurs</strong> dans le tempérament sélectionné : Chaque note du cycle des quintes représente la <strong>tonalité majeure</strong> correspondante. La note C représente donc l’accord de Do Majeur. Le visuel TemperApp <i>décrit</i> cet accord.</p><p class=\"p-long\">Pour chaque accord majeur, les qualités des quintes et des tierces sont représentées par une couleur. Les <strong>quintes</strong> sont représentées à <strong>l’extérieur</strong> du cycle, les <strong>tierces</strong> à <strong>l’intérieur.</strong> </p><p class=\"p-long\">Plus la couleur de l’intervalle est <strong>sombre</strong>, plus celui-ci est <strong>tempéré.</p>",
  "modalIncipit2": "Paramètres disponibles",
  "modalContent2": "<p class=\"p-long\">Le visuel TemperApp a deux paramètres possibles : Aux <strong>thèmes</strong> clair ou sombre correspondent deux dégradés différents fonctionnant sur le même principe L’utilisateur a la possibilité de superposer au dégradé de couleur la valeur du tempérament des intervalles en fraction de Commas (Pythagoricien pour les quintes, Syntonique pour les tierces). Pour plus d’information sur les unités utilisées par TemperApp, voir @</p>",
  "modalSubTitle3": "Pitch pipe & battements",
  "modalIncipit3": "Temperapp propose deux accordeurs.",
  "modalContent3": "Le <strong>“pitch pipe”</strong> émet la fréquence de la note à accorder.",
  "modalContent3.5": "L'accordeur <strong>“par battements”</strong> émet le battement prévu d’un intervalle, de la même manière qu’il sonne à l’instrument : un son à la hauteur du premier partiel commun et d’un battement égal à la différence entre les deux partiels. <i>Un intervalle pur émet donc un son continu à la hauteur du premier partiel commun.</i>",
  "modalSubTitle4": "Selection d'un intervalle",
  "modalContent4": "Les intervalles disponibles dans TemperApp sont les quartes, les quintes et les tierces majeures.<br><br>Pour sélectionner un intervalle, appuyez sur les notes correspondantes en respectant leur octave :<br><br>une pression <strong>longue</strong> sélectionne la note à l’octave 3 (clé de fa)<br>une pression <strong>courte</strong> sélectionne la note à l’octave 4 (clé de sol).<br><br>Lorsqu’une note est sélectionnée, l’application génère sa fréquence. Lorsqu’un intervalle est sélectionné, l’application génère immédiatement son battement !",
  "modalSubTitle5": "Procédure d'accord",
  "modalContent5": "TemperApp vous accompagne dans l’accord de votre instrument. Pour chaque tempérament, l’application vous propose une procédure d’accord.",
  "modalContent5.5": "<p class=\"p-long\">À chaque étape vous êtes invité·e à accorder une note qui <strong>clignotera</strong>sur un affichage clavier.</p><p class=\"p-long\">Cette note sera accordée comme un intervalle sur une note déjà accordée.</p><p class=\"p-long\">Le battement de l’intervalle est affiché au centre du cercle et généré par l’application.</p><p class=\"p-long\">A tout moment vous pouvez aller à l’étape précédente, suivante ou interrompre la procédure.</p>",
  "modalIncipit6": "Diagramme",
  "modalContent6": "<p class=\"p-long\">Temperapp vous propose un diagramme innovant, où les accords majeurs sont représentés avec deux coordonnées : en abscisse le tempérament de la quinte, et en ordonnée le tempérament de la tierce majeure. Les triades représentées dans le coin inférieur gauche du diagramme ont leur tierce plutôt pure et leur quinte plutôt tempérée (en général autour de Do Majeur). A l'opposé du graphique, les quintes sont plutôt pure et les tierces plutôt tempérées, en général autour de Fa# Majeur. Ainsi, vous pouvez immédiatement voir la couleur de chaque accord majeur du tempérament et identifier sa structure, à savoir s'il évolue de manière plutôt abrupte ou au contraire plutôt lisse.  En particulier, vous pouvez identifier les tonalités dont les accords majeurs sont tempérés de la même manière.  </p>",
  "centralCard": {
    "excessivelyTempered": "Excessivement tempérée",
    "veryTempered": "Très tempérée",
    "tempered": "Tempérée",
    "wellTempered": "Bien tempérée",
    "equallyTempered": "Egale",
    "lightlyTempered": "faiblement tempérée",
    "pure": "Pure",
    "bigFifth": "grande quinte",
    "loup": "Loup",
    "pythagorean": "Pythagoricienne"
  }
}
